"Prevent accidental quitting" = "Cegah berhenti tidak sengaja";
"Monthly" = "Bulanan";
"Check for update immediately" = "Cek pembaruan segera";
"Add Quicksilver to your login items" = "Tambahan Quicksilver ke butir-butir Login";
"Download updates in the background" = "Unduh pembaruan di belakang layar";
"Restart immediately" = "Hidupkan ulang segera";
"Warn before quitting" = "Peringatkan sebelum berhenti";
"Normal" = "Normal";
"Run Setup" = "Jalankan Setup";
"Enable update checking" = "Aktifkan cek pembaruan";
"Now" = "Sekarang";
"⌽" = "⌽";